** i

#+BEGIN_SRC R :results output :exports both
  tonsilData <- read.table( 'Tonsils.dat', header=FALSE )

  ##Firstly, V5 is whether or not they have tonsils
  ##V1 - D_00
  ##V2 - D_01
  ##V3 - D_10
  ##V4 - D_11

  ## for the model X will be transformed into a tuple of 4 values:
  ## X = (start state 0, tonsils; start 1, tonsils; start 0, no tonsils; start 1, no tonsils )
  ## Y = end at state 1

  tonsilModel <- glm( formula=I( V2 + V4) ~ I(V5*(V1 + V2) ) + I( V5*(V3
  + V4) ) + I( (1-V5)*(V1 + V2)) + I( (1-V5)*(V3+V4)) - 1, family =
                                                               binomial, data=tonsilData )
  noTonsilModel <-
      glm( formula = I( V2 + V4) ~ I(V1 + V2) + I(V3 + V4) - 1, family=binomial, data=tonsilData )

  ## Under tonsil Model:
  ## P( Y = 1 | X = ( 0, 0, 1, 0 ) ) = 1 - \pi_{00}^N
  ## P( Y = 1 | X = ( 0, 0, 0, 1 ) ) = \pi_{11}^N
  ## P( Y = 1 | X = ( 1, 0, 0, 0 ) ) = 1 - \pi_{00}^W
  ## P( Y = 1 | X = ( 0, 1, 0, 0 ) ) = \pi_{11}^W
  pi00.N <- 1.0 -  1.0 /
      ( 1.0 + exp( -sum( tonsilModel$coefficients* c(0,0,1,0)) ) )

  pi11.N <- 1.0 /
      ( 1.0 + exp( -sum( tonsilModel$coefficients* c(0,0,0,1)) ) )

  pi00.W <- 1.0 -  1.0 /
      ( 1.0 + exp( -sum( tonsilModel$coefficients*c(1,0,0,0)) ) )

  pi11.W <- 1.0 /
      ( 1.0 + exp( -sum( tonsilModel$coefficients*c(0,1,0,0)) ) )

  print( "Under the alternate:" )
  print( sprintf("pi00.N = %f, pi11.N = %f, pi00.W = %f, pi11.N = %f", pi00.N, pi11.N, pi00.W, pi11.W ) )

  ## P( Y = 1 | X = ( 1, 0 ) ) = 1 - \pi_{00}
  ## P( Y = 1 | X = ( 0, 1 ) ) = \pi_{11}

  pi11 <- 1.0 / ( 1.0 + exp( -sum( noTonsilModel$coefficients*c(0,1)) ) )
  pi00 <- 1.0 -  1.0 /
      ( 1.0 + exp( -sum( noTonsilModel$coefficients*c(1,0)) ) )

  print( "Under the Null:" )
  print( sprintf( "pi11 = %f, pi00 = %f", pi00, pi11 ) )

  chiStat <- 2*(logLik( tonsilModel )[1] - logLik( noTonsilModel )[1] )
  pValue <- pchisq( chiStat, 2, lower.tail = FALSE )
  print( sprintf( "Using a Likelihood ratio test: p-value of: %f", pValue ) )

#+END_SRC

#+RESULTS:
: [1] "Under the alternate:"
: [1] "pi00.N = 0.062500, pi11.N = 0.666667, pi00.W = 0.375000, pi11.N = 0.363636"
: [1] "Under the Null:"
: [1] "pi11 = 0.250000, pi00 = 0.500000"
: [1] "Using a Likelihood ratio test: p-value of: 0.003527"

We find that under the alternate we get very clean numbers for our
probability estimates: 
| \pi_{00}^N | $\frac{15}{16}$ |
| \pi_{11}^N | $\frac{1}{3}$ |
| \pi_{00}^W | $\frac{5}{8}$ |
| \pi_{11}^W | $\frac{7}{11}$ |

Under the null hypothesis we get:
| \pi_{00} | $\frac{3}{4}$ |
| \pi_{11}  | $\frac{1}{2}$ |

